app/Http/Controllers/BranchController.php

select `company_branch`.`id` as `branchid`, `company_branch`.`location_name`, `company_branch`.`email`, `company_branch`.`phone`, `company_branch`.`address_1`, `company_branch`.`location_head`, `company_branch`.`address_2`, `company_branch`.`state`, `company_branch`.`zipcode`, `company_branch`.`company_id`, `company_branch`.`city`, `company`.`id` as `company_id`, `company`.`name`, `employee`.`id` as `employee_id`, `employee`.`firstname`, `employee`.`lastname`, `company_branch`.`deleted_at` from `company_branch` inner join `company` on `company_branch`.`company_id` = `company`.`id` inner join `employee` on `company_branch`.`location_head` = `employee`.`id` where `company_branch`.`deleted_at` is null
select * from `company_branch` inner join `company` on `company_branch`.`company_id` = `company`.`id` inner join `employee` on `company_branch`.`location_head` = `employee`.`id` where `company_branch`.`deleted_at` is null
select * from `company` where `company`.`deleted_at` is null
select * from `employee`
---
    public function index()
    {
        //

        $branch = DB::table('company_branch')
            ->select('company_branch.id as branchid', 'company_branch.location_name', 'company_branch.email', 'company_branch.phone',
                'company_branch.address_1', 'company_branch.location_head', 'company_branch.address_2', 'company_branch.state', 'company_branch.zipcode',
                'company_branch.company_id', 'company_branch.city', 'company.id as company_id', 'company.name', 'employee.id as employee_id', 'employee.firstname', 'employee.lastname', 'company_branch.deleted_at')
            ->join('company', 'company_branch.company_id', '=', 'company.id')
            ->join('employee', 'company_branch.location_head', '=', 'employee.id')
            ->whereNull('company_branch.deleted_at')
            ->get();

        $company = Company::all();
        $employee = Employee::all();