app/Http/Controllers/CompanyController.php

select * from `company` where `company`.`deleted_at` is null
---
    public function index()
    {
        //
        $company = Company::all();