app/Http/Controllers/DepartmentController.php

select `company_department`.`id` as `department_id`, `company_department`.`branch_id`, `company_department`.`department_name`, `company_department`.`department_head`, `company_branch`.`id` as `branch_id`, `company_branch`.`location_name`, `company_department`.`deleted_at`, `employee`.`id`, `employee`.`firstname`, `employee`.`lastname` from `company_department` inner join `employee` on `employee`.`id` = `company_department`.`department_head` inner join `company_branch` on `company_branch`.`id` = `company_department`.`branch_id` where `company_department`.`deleted_at` is null
select * from `company` where `company`.`deleted_at` is null
select * from `employee`
select * from `employee` order by `id` asc
select * from `company_branch` where `company_branch`.`deleted_at` is null order by `id` asc
select * from `company_department` where `company_department`.`deleted_at` is null
---
    public function index()
    {
        //
        $data = DB::table('company_department')
            ->select('company_department.id as department_id', 'company_department.branch_id', 'company_department.department_name',
                'company_department.department_head', 'company_branch.id as branch_id', 'company_branch.location_name', 'company_department.deleted_at',
                'employee.id', 'employee.firstname', 'employee.lastname')
            ->join('employee', 'employee.id', '=', 'company_department.department_head')
            ->join('company_branch', 'company_branch.id', '=', 'company_department.branch_id')
            ->whereNull('company_department.deleted_at')
            ->get();

        $company = Company::all();
        $employee = Employee::all()->sortByDesc('id');
        $branch = Branch::all()->sortByDesc('id');
        $department = Department::all()->sortByDesc('id');